const Discord = require('discord.js');

var rules1 = new Discord.RichEmbed()
        .addField("قوانین (1/2):", "---------------------------------------------------------------------------------------\n" +
                                  "__**1.**__ <a:721526931392168006:738748831398887498> اطلعات شخضی خود  را به اشتراک نگذارید \n" +
                                  "__**2.**__ <a:721526931392168006:738748831398887498> مشکلات هر بخش را به ادمین مربوطه اطلاع دهید \n" +
                                  "__**3.**__ <a:721526931392168006:738748831398887498> مسخره نکنید \n" +
                                  "__**4.**__ <a:721526931392168006:738748831398887498> در ویس ها اختلال ایجاد نکنید\n" +
                                  "__**5.**__ <a:721526931392168006:738748831398887498> در ویس ها توهین نکنید \n" +
                                  "__**6.**__ <a:721526931392168006:738748831398887498> تبلیغ نکنید \n" +
                                  "__**7.**__ <a:721526931392168006:738748831398887498> پست های نژاد پرستانه ارسال نکنید\n", true)

        .setColor("0xFF0000")
        

var rules2 = new Discord.RichEmbed()
        .addField("قوانین (2/2):", "__**8.**__ <a:721526931392168006:738748831398887498> به هم دیگر احترام بگزارید \n" +
                                  "__**9.**__ <a:721526931392168006:738748831398887498> در هر بخش کار مربوطه را انجام دهید \n" +
                                  "__**10.**__. <a:721526931392168006:738748831398887498> درخواست رنک نکنید \n" +
                                  "__**11.**__ <a:721526931392168006:738748831398887498> توهین نکنید \n" +
                                  "__**12.**__ <a:721526931392168006:738748831398887498> نژاد پرستی نکنید \n" +
                                  "__**13.**__ <a:721526931392168006:738748831398887498> اسپم نکنید \n" +
                                  "---------------------------------------------------------------------------------------\n", true)

        .setColor("0xFF0000")


        .setFooter("Persian X Commounity")







exports.run = (bot, msg, params) => {

  msg.channel.send(rules1)
  msg.channel.send(rules2)

};

exports.conf = {
  enabled: true,
  guildOnly: false,
  aliases: ['rule'],
  permLevel: 0
};

exports.help = {
  name: "rules",
  description: "قوانین",
  usage: "rules"
};
